docs: switch architecture diagram to ascii
